-------------------------------------------------------------------------------------
-- -*- coding: utf-8 -*-
--
-- @author:   admin
-- @email:    88888@qq.com
-- @date:     2022-06-30
-- @module:   achieve_res
-- @describe: 公共资源模块
-- @version:  v1.0
--

-------------------------------------------------------------------------------------
-- 冒险模块资源
---@class achieve_res
local achieve_res = {
    -- 见闻录
    ACHIEVE_LOG = {
        { c_pre_value = 30, c_pre_id = 0, name = '30%见闻录达成礼包' },
        { c_pre_value = 45, c_pre_id = 1, name = '45%见闻录达成礼包' },
        { c_pre_value = 55, c_pre_id = 2, name = '55%见闻录达成礼包' },
        { c_pre_value = 65, c_pre_id = 3, name = '65%见闻录达成礼包' },
        { c_pre_value = 75, c_pre_id = 4, name = '75%见闻录达成礼包' },
        { c_pre_value = 90, c_pre_id = 5, name = '90%见闻录达成礼包' },
        { c_pre_value = 100, c_pre_id = 6, name = '100%见闻录达成礼包' }
    }
}

local this = achieve_res
-------------------------------------------------------------------------------------
--


-------------------------------------------------------------------------------------
-- 返回对象
return achieve_res

-------------------------------------------------------------------------------------