-------------------------------------------------------------------------------------
-- -*- coding: utf-8 -*-
--
-- @author:   admin
-- @email:    88888@qq.com
-- @date:     2022-06-30
-- @module:   ui_res
-- @describe: 公共资源模块
-- @version:  v1.0
--

-------------------------------------------------------------------------------------
-- ui模块资源
---@class avatar_res
local avatar_res = {
    AVATAR_REEL ={
        {name =  '【活动】化身召唤券', res_id = 0},
        {name =  '高级必获化身召唤券', res_id = 0},
        {name =  '活动化身召唤券', res_id = 0},
        {name =  '宝物必获化身召唤券', res_id = 0},
    },
    AVATAR_INFO = {
        --32106.0|火龙先锋军士（女）
        --32219.0|罗极先锋军士（男）
        --42209.0|迷魂明军士（男）
        --普通
        name = '',
        [2202] = {name = '初级法师（男）', },
        [2102] = {name = '初级法师（女）',},
        [12201] = {name = '术法学者（男）', ['挖矿'] = { down_time = 1 } },
        [12102] = { name = '术法学者（女）', ['割草'] = { down_time = 2.3 } },
        [12203] = {name = '护卫兵（男）', ['钓鱼'] = { up_success = 3.5 } },
        [12104] = { name = '护卫兵（女）',['挖矿'] = { down_time = 4.9 } },
        [12205] = {name = '修炼法师（男）', ['割草'] = { down_time = 6.2 } },
        [12106] = {name = '修炼法师（女）', ['钓鱼'] = { up_success = 7.4 } },
        [12207] = {name = '流浪法师（男）', ['割草'] = { down_time = 8.8 } },
        [12108] = {name = '流浪法师（女）', ['钓鱼'] = { up_success = 10 } },


        --高级
        [22201] = {name = '蝴蝶法师（男）', ['挖矿'] = { down_time = 5, up_level = 3 } },
        [22102] = {name = '蝴蝶法师（女）', ['挖矿'] = { down_time = 5.6 }, ['割草'] = { up_level = 2 } },
        [22203] = {name = '百蝶法师（男）', ['挖矿'] = { down_time = 6.1 }, ['钓鱼'] = { up_level = 2 } },
        [22104] = {name = '百蝶法师（女）', ['挖矿'] = { up_level = 2 }, ['割草'] = { down_time = 6.7 } },
        [22205] = {name = '红浪法师（男）', ['割草'] = { down_time = 7.2, up_level = 2 } },
        [22106] = {name = '红浪法师（女）', ['割草'] = { down_time = 7.8 }, ['钓鱼'] = { up_level = 1 } },
        [22207] = {name = '青浪法师（男）', ['钓鱼'] = { up_success = 16.6 }, ['挖矿'] = { up_level = 1 } },
        [22108] = {name = '青浪法师（女）', ['钓鱼'] = { up_success = 17.7 }, ['割草'] = { up_level = 1 } },
        [22209] = {name = '精英进击法师（男）', ['钓鱼'] = { up_success = 18.8, up_level = 1 } },
        [22110] = {name = '精英进击法师（女）', ['挖矿'] = { down_time = 10, up_level = 1 } },
        [22211] = {name = '精英守护法师（男）', ['割草'] = { down_time = 8.3, up_level = 2 } },
        [22112] = {name = '精英守护法师（女）', ['钓鱼'] = { up_success = 17.3, up_level = 2 } },
        [22213] = {name = '玉布灵士（男）', ['挖矿'] = { down_time = 9, up_level = 2 } },
        [22114] = {name = '玉布灵士（女）', ['割草'] = { down_time = 9.3, up_level = 2 } },
        [22215] = {name = '青布灵士（男）', ['钓鱼'] = { down_time = 19.3, up_level = 2 } },
        [22116] = {name = '青布灵士（女）', ['挖矿'] = { down_time = 10 }, ['割草'] = { up_level = 3 } },
        --宝物
        [32201] = {name = '侠士护术师（男）', ['钓鱼'] = { down_time = 7 }, ['割草'] = { down_time = 8 } },
        [32102] = {name = '侠士护术师（女）', ['钓鱼'] = { down_time = 7.5 }, ['割草'] = { down_time = 8 } },
        [32203] = {name = '侠士护法师（男）', ['挖矿'] = { up_level = 2 }, ['钓鱼'] = { down_time = 8 }, },
        [32104] = {name = '侠士护法师（女）', ['钓鱼'] = { down_time = 8.5, up_level = 2 }, },
        [32205] = {name = '火龙先锋军士（男）', ['钓鱼'] = { down_time = 9 }, ['割草'] = { up_level = 2 } },
        [32106] = {name = '火龙先锋军士（女）', ['钓鱼'] = { down_time = 8 }, ['割草'] = { down_time = 7 } },
        [32207] = {name = '火龙守门军士（男）', ['挖矿'] = { down_time = 8 }, ['割草'] = { down_time = 7.5 } },
        [32108] = {name = '火龙守门军士（女）', ['挖矿'] = { up_level = 3 }, ['割草'] = { down_time = 8 } },
        [32209] = {name = '火焰神灵士（男）', ['钓鱼'] = { up_level = 3 }, ['割草'] = { down_time = 8.5 } },
        [32110] = {name = '火焰神灵士（女）', ['割草'] = { down_time = 9, up_level = 3 } },
        [32211] = {name = '火焰魔灵士（男）', ['挖矿'] = { down_time = 7 }, ['割草'] = { down_time = 8 } },
        [32112] = {name = '火焰魔灵士（女）', ['挖矿'] = { down_time = 7.5 }, ['割草'] = { down_time = 8 } },
        [32213] = {name = '古魂法将（男）', ['挖矿'] = { down_time = 8, up_level = 2 }, },
        [32114] = {name = '古魂法将（女）', ['挖矿'] = { down_time = 8.5 }, ['钓鱼'] = { up_level = 2 }, },
        [32215] = {name = '无节神灵士（男）', ['挖矿'] = { down_time = 9 }, ['割草'] = { up_level = 2 } },
        [32116] = {name = '无节神灵士（女）', ['挖矿'] = { up_level = 2 }, ['钓鱼'] = { down_time = 7 }, },
        [32217] = {name = '无节魔灵士（男）', ['挖矿'] = { up_level = 3 }, ['割草'] = { down_time = 8 } },
        [32118] = {name = '无节魔灵士（女）', ['挖矿'] = { up_level = 2, down_time = 9 }, },
        [32219] = {name = '罗极先锋军士（男）', ['挖矿'] = { up_level = 3 }, ['钓鱼'] = { up_level = 2 }, },
        [32120] = {name = '罗极先锋军士（女）', ['挖矿'] = { up_level = 2 }, ['割草'] = { up_level = 3 } },
        [32221] = {name = '罗极守门军士（男）', ['钓鱼'] = { up_level = 2, down_time = 7 }, },
        [32122] = {name = '罗极守门军士（女）', ['钓鱼'] = { up_level = 3 }, ['割草'] = { down_time = 8 } },
        [32223] = {name = '咒火法将（男）', ['挖矿'] = { down_time = 9 }, ['钓鱼'] = { up_level = 2 }, },
        [32124] = {name = '咒火法将（女）', ['挖矿'] = { up_level = 3 }, ['钓鱼'] = { up_level = 3 }, },
        [32225] = {name = '天律术将（男）', ['钓鱼'] = { up_level = 2 }, ['割草'] = { up_level = 2 } },
        [32126] = {name = '天律术将（女）', ['钓鱼'] = { down_time = 7 }, ['割草'] = { up_level = 2 } },
        [32227] = {name = '天律祭将（男）', ['割草'] = { up_level = 3, down_time = 8 } },
        [32128] = {name = '天律祭将（女）', ['挖矿'] = { down_time = 9 }, ['割草'] = { up_level = 2 } },
        [32229] = {name = '日云护术师（男）', ['挖矿'] = { up_level = 2 }, ['割草'] = { up_level = 3 } },
        [32130] = {name = '日云护术师（女）', ['钓鱼'] = { up_level = 3 }, ['割草'] = { up_level = 2 } },
        [32231] = {name = '日云护法师（男）', ['钓鱼'] = { down_time = 8, up_level = 2 }, },
        [32132] = {name = '日云护法师（女）', ['割草'] = { down_time = 8, up_level = 2 } },
        --圣物
        [42201] = {name = '演星神灵将（男）', ['钓鱼'] = { down_time = 10 }, ['割草'] = { down_time = 10 } },
        [42102] = {name = '演星神灵将（女）', ['钓鱼'] = { down_time = 10.5 }, ['割草'] = { down_time = 10 } },
        [42203] = {name = '演星魔灵将（男）', ['挖矿'] = { up_level = 3 }, ['钓鱼'] = { down_time = 11 }, },
        [42104] = {name = '演星魔灵将（女）', ['钓鱼'] = { down_time = 11.5, up_level = 3 }, },
        [42205] = {name = '天义武官（男）', ['钓鱼'] = { down_time = 12 }, ['割草'] = { up_level = 3 } },
        [42106] = {name = '天义武官（女）', ['钓鱼'] = { down_time = 10 }, ['割草'] = { down_time = 10 } },
        [42207] = {name = '天义御士（男）', ['挖矿'] = { down_time = 10 }, ['割草'] = { down_time = 10.5 } },
        [42108] = {name = '天义御士（女）', ['挖矿'] = { up_level = 4 }, ['割草'] = { down_time = 11 } },
        [42209] = {name = '迷魂明军士（男）', ['钓鱼'] = { up_level = 4 }, ['割草'] = { down_time = 11.5 } },
        [42110] = {name = '迷魂明军士（女）', ['割草'] = { down_time = 12, up_level = 4 } },
        [42211] = {name = '迷魂幻军士（男）', ['挖矿'] = { down_time = 10 }, ['钓鱼'] = { down_time = 10 }, },
        [42112] = {name = '迷魂幻军士（女）', ['挖矿'] = { down_time = 10.5 }, ['割草'] = { down_time = 10 } },
        [42213] = {name = '赤魔法将（男）', ['挖矿'] = { down_time = 10, up_level = 5 }, },
        [42114] = {name = '赤魔法将（女）', ['挖矿'] = { down_time = 11.5 }, ['钓鱼'] = { up_level = 5 }, },
        [42215] = {name = '破皇天魔贤人（男）', ['挖矿'] = { down_time = 12 }, ['割草'] = { up_level = 5 } },
        [42116] = {name = '破皇天魔贤人（女）', ['铁匠'] = { up_level = 3 }, ['炼金'] = { up_level = 3 } },
        [42217] = {name = '合化护法师（男）', ['铁匠'] = { up_level = 3, up_success = 3 } },
        [42118] = {name = '合化护法师（女）', ['铁匠'] = { up_level = 4 }, ['炼金'] = { up_success = 3 } },
        [42219] = {name = '合化浩唤师（男）', ['铁匠'] = { up_level = 4 }, ['鉴定'] = { up_success = 3 } },
        [42120] = {name = '合化浩唤师（女）', ['铁匠'] = { up_level = 3 }, ['炼金'] = { up_level = 3 } },
        [42221] = {name = '空轮青天法师（男）', ['铁匠'] = { up_success = 4 }, ['炼金'] = { up_level = 3 } },
        [42122] = {name = '空轮青天法师（女）', ['炼金'] = { up_level = 3, up_success = 4 } },
        [42223] = {name = '空轮黑天法师（男）', ['炼金'] = { up_level = 4 }, ['鉴定'] = { up_success = 4 } },
        [42124] = {name = '空轮黑天法师（女）', ['钓鱼'] = { down_time = 10 }, ['铁匠'] = { up_success = 5 } },
        [42225] = {name = '天林白刚祭长（男）', ['钓鱼'] = { down_time = 11 }, ['铁匠'] = { up_success = 4 } },
        [42126] = {name = '天林白刚祭长（女）', ['钓鱼'] = { down_time = 12 }, ['铁匠'] = { up_success = 3 } },
        [42227] = {name = '天林金刚祭长（男）', ['炼金'] = { up_success = 5 }, ['割草'] = { down_time = 10 } },
        [42128] = {name = '天林金刚祭长（女）', ['炼金'] = { up_success = 4 }, ['割草'] = { down_time = 11 } },
        [42229] = {name = '光炎神灵士（男）', ['炼金'] = { up_success = 3 }, ['割草'] = { down_time = 12 } },
        [42130] = {name = '光炎神灵士（女）', ['挖矿'] = { down_time = 10 }, ['鉴定'] = { up_success = 5 }, },
        [42231] = {name = '光炎魔灵士（男）', ['挖矿'] = { down_time = 11 }, ['鉴定'] = { up_success = 4 }, },
        [42132] = {name = '光炎魔灵士（女）', ['挖矿'] = { down_time = 12 }, ['鉴定'] = { up_success = 3 }, },
        --神物
        [52201] = {name = '恶魔护法将（男）', ['钓鱼'] = { down_time = 13.5, up_level = 3 }, ['铁匠'] = { up_level = 3 } },
        [52102] = {name = '恶魔护法将（女）', ['炼金'] = { up_level = 3 }, ['割草'] = { down_time = 13.5, up_level = 3 } },
        [52203] = {name = '天龙不死贤人（男）', ['挖矿'] = { down_time = 13.5, up_level = 3 }, ['精工'] = { up_level = 3 }, },
        [52104] = {name = '天龙不死贤人（女）', ['铁匠'] = { up_level = 4, up_success = 8 }, ['钓鱼'] = { down_time = 13.5 }, },
        [52205] = {name = '虹炎仙人（男）', ['炼金'] = { up_level = 4, up_success = 8 }, ['割草'] = { down_time = 13.5 } },
        [52106] = {name = '虹炎仙人（女）', ['挖矿'] = { down_time = 13.5 }, ['精工'] = { up_level = 4, up_success = 8 }, },
        [52207] = {name = '孔雀青天人（男）', ['挖矿'] = { down_time = 12.5 }, ['钓鱼'] = { down_time = 12.5 }, ['割草'] = { down_time = 12.5 } },
        [52108] = {name = '孔雀青天人（女）', ['精工'] = { up_success = 7 }, ['炼金'] = { up_success = 7 }, ['铁匠'] = { up_success = 7 } },
        --天尊
        [62201] = {name = '天尊', ['精工'] = { up_success = 10 }, ['炼金'] = { up_success = 10 }, ['铁匠'] = { up_success = 10 } },
        [62102] = {name = '雷帝', ['精工'] = { up_success = 10 }, ['炼金'] = { up_success = 10 }, ['铁匠'] = { up_success = 10 } },
    },

}



local this = avatar_res

-------------------------------------------------------------------------------------
--


-------------------------------------------------------------------------------------
-- 返回对象
return avatar_res

-------------------------------------------------------------------------------------