local VERSION = "2023-4-5"
local AUTHOR_NOTE = "Administrator"

---@class hunt_res
local hunt_res = {
    VERSION = VERSION,
    AUTHOR_NOTE = AUTHOR_NOTE,
    MODULE_NAME = "hunt_res",
}

local this = hunt_res

-- 第一个坐标为刷铜坐标
this.hunt_info = {
    [15] = {
        { 24166, 4953, 12171, 101, '银杏谷村庄' },
        { 21489, 13793, 7713, 102, '银杏谷野外' },
    },
    [20] = {
        { 24166, 4953, 12171, 101, '银杏谷村庄' },
        --{ 5249, 16747, 11155, 101, '银杏谷村庄' },
    },
    [25] = {
        { 24166, 4953, 12171, 101, '银杏谷村庄' },
        --{ 5249, 16747, 11155, 101, '银杏谷村庄' },
        { 15346, 2590, 17537, 213, '半兽人洞穴3层' },
    },
    [30] = {
        { 24166, 4953, 12171, 101, '银杏谷村庄' },
        --{ 5249, 16747, 11155, 101, '银杏谷村庄' },
        { 5375, 16575, 11125, 104, '比奇野外' },
        { 15346, 2590, 17537, 213, '半兽人洞穴3层' },
        { 6502, 19537, 16359, 213, '半兽人洞穴3层' }
    },
}
-------------------------------------------------------------------------------------
-- 返回对象
return hunt_res