-------------------------------------------------------------------------------------
-- -*- coding: utf-8 -*-
--
-- @author:   admin
-- @email:    88888@qq.com
-- @date:     2022-06-30
-- @module:   login_res
-- @describe: 登陆模块用到的资源
-- @version:  v1.0
--

-------------------------------------------------------------------------------------
-- 登陆模块资源
---@class login_res
local login_res = {
    -- 职业名称对应ID列表
    JOB_IDS = {
        ['战士'] = 0x0C,
        ['术士'] = 0x15,
        ['道士'] = 0x1F,
    },

    -- 启动页面
    STATUS_INTRO_PAGE = 0, -- 0x01,            -- 进入游戏时的启动页面
    STATUS_LOGO_PAGE = 0x02,             -- 游戏logo页面
    STATUS_DOWNLOAD_PAGE = 0x04,         -- 游戏下载更新页面
    STATUS_RESERVED1 = 0x08,             -- 预留状态1
    STATUS_RESERVED2 = 0x10,             -- 预留状态2
  
    -- 登陆页面
    STATUS_LOGIN_PAGE = 100,             --0x20,            -- 登陆页面
    STATUS_ACCOUNT_LOGIN_PAGE = 0x40,    -- 帐号密码登陆页面
    STATUS_THIRDPARTY_LOGIN_PAGE = 101,  -- 0x40, -- 第三方登陆页面(暂定成一个)
    STATUS_GOOGLE_LOGIN_PAGE = 102,      --0x80,     -- Google账号登陆页面
    STATUS_APPLE_LOGIN_PAGE = 0x100,     -- Apple账号登陆页面
    STATUS_FACEBOOK_LOGIN_PAGE = 0x200,  -- Facebook账号登陆页面
    STATUS_TERMS_AGREEMENT_PAGE = 103,   --0x400, -- 服务条款同意页面
    STATUS_SERVER_SELECT_PAGE = 104,     --0x800,   -- 服务器选择页面
    STATUS_RESERVED3 = 0x1000,           -- 预留状态3
    STATUS_RESERVED4 = 0x2000,           -- 预留状态4
  
    -- 选择角色
    STATUS_CHARACTER_SELECT = 300,       --0x4000,    -- 角色选择页面
    STATUS_RESERVED5 = 0x8000,           -- 预留状态5
    STATUS_RESERVED6 = 0x10000,          -- 预留状态6
  
    -- 创建角色
    STATUS_CREATE_CHARACTER = 200,       --0x20000,   -- 创建角色页面
    STATUS_RESERVED7 = 0x40000,          -- 预留状态7
    STATUS_RESERVED8 = 0x80000,          -- 预留状态8
  
    -- 游戏里面
    STATUS_IN_GAME = 400,                --0x100000,           -- 进入游戏内部状态
    STATUS_LOADING_MAP = 500,            --0x200000,       -- 地图加载中状态
    STATUS_RESERVED9 = 0x400000,         -- 预留状态9
    STATUS_RESERVED10 = 0x800000         -- 预留状态10
}

local this = login_res

this.server_name = {
    ['青龙01'] = '백호01',
    ['青龙02'] = '백호02',
    ['青龙03'] = '백호03',
    ['青龙04'] = '백호04',
    ['青龙05'] = '백호05',
    ['青龙06'] = '백호06',
    ['青龙07'] = '백호07',
    ['青龙08'] = '백호08',
    ['朱雀01'] = '백호01',
    ['朱雀02'] = '백호02',
    ['朱雀03'] = '백호03',
    ['朱雀04'] = '백호04',
    ['朱雀05'] = '백호05',
    ['朱雀06'] = '백호06',
    ['朱雀07'] = '백호07',
    ['朱雀08'] = '백호08',
    ['玄武01'] = '백호01',
    ['玄武02'] = '백호02',
    ['玄武03'] = '백호03',
    ['玄武04'] = '백호04',
    ['玄武05'] = '백호05',
    ['玄武06'] = '백호06',
    ['玄武07'] = '백호07',
    ['玄武08'] = '백호08',
    ['白虎01'] = '백호01',
    ['白虎02'] = '백호02',
    ['白虎03'] = '백호03',
    ['白虎04'] = '백호04',
    ['白虎05'] = '백호05',
    ['白虎06'] = '백호06',
    ['白虎07'] = '백호07',
    ['白虎08'] = '백호08'

}
-------------------------------------------------------------------------------------
-- 读取帐号配置职业ID
login_res.get_create_job_id = function()
    return this.JOB_IDS[main_ctx:c_job()] or 0
end

-------------------------------------------------------------------------------------
-- 返回对象
return login_res

-------------------------------------------------------------------------------------