-------------------------------------------------------------------------------------
-- -*- coding: utf-8 -*-
--
-- @author:   admin
-- @email:    88888@qq.com
-- @date:     2022-06-30
-- @module:   ui_res
-- @describe: 公共资源模块
-- @version:  v1.0
--

-------------------------------------------------------------------------------------
-- 地图模块资源
---@class map_res
local map_res = {
    --地图传送资源
    MAP_TELEPORT = {
        --银杏谷村庄
        [101] = {
            --传送门
            ['被雷击中的银杏树'] = 0x2329,
            ['银杏谷野外入口'] = 0x65,
            --NPC
            ['药水商人姚智有'] = 0x2738,
            ['武器商人孔莹晏'] = 0x272E,
            ['服装商人许飞蓝'] = 0x276A,
            ['饰品商人香梅'] = 0x2832,
            ['杂货商人苍鸿运'] = 0x2742,
            ['仓库管理员美洋'] = 0x2850,
            ['银杏谷村长周振扬'] = 0x271A,
            ['书店掌柜任自缘'] = 0x2724,
            ['酒馆掌柜尹醉香'] = 0x2760,
            ['小狗汪汪'] = 0x277E,
            ['学者郑理明'] = 0x27D8,
            ['内功大师椿德'] = 0x285A,
            ['交易所长吴巨鹏'] = 0x2878,
            --采集
            ['普通鱼塘'] = 0x191,
            ['普通矿脉'] = 0x194,
            ['绿茵群集'] = 0x193,
            --怪物
            ['狼'] = 0x1F7,
            ['蛤蟆幼崽'] = 0x1F6,
            ['蛤蟆'] = 0x1F5,
            ['草帽稻草人'] = 0x1F8,
            ['稻草人'] = 0x1F9,
            ['【活动】巨型稻草人'] = 0x1FA,
        },
        --银杏谷野外
        [102] = {
            --传送门
            ['银杏谷野外半山腰'] = 0x2329,
            ['银杏谷入口'] = 0x65,
            ['比奇入口'] = 0x67,
            ['银杏谷废矿1层入口'] = 0x66,
            --NPC
            ['自警团长高鹏兴'] = 0x2756,
            ['自警团员于晶'] = 0x2792,
            ['自警团员德秀'] = 0x279C,
            ['自警团员吴正根'] = 0x27A6,
            ['自警团员容邵'] = 0x2800,
            ['自警团员许坛'] = 0x280A,
            ['自警团员牛炳'] = 0x2814,
            ['自警团员智曹'] = 0x281E,
            ['推车商人的尸体'] = 0x2828,
            ['推车商人的妻子'] = 0x283C,
            ['自警团员慕容'] = 0x28A0,
            ['玄黑僧侣'] = 0x28AA,
            --采集
            ['普通鱼塘'] = 0x19A,
            ['绿岭矿脉'] = 0x192,
            ['草木群集'] = 0x193,
            ['草木群集'] = 0x191,
            --怪物
            ['狼'] = 0x1FA,
            ['蛤蟆幼崽'] = 0x1F9,
            ['魁梧的猫人'] = 0x1FF,
            ['嚣张的蛤蟆'] = 0x1FB,
            ['钩猫人'] = 0x1F5,
            ['钉耙猫人'] = 0x1F6,
            ['水之守护者'] = 0x1FC,
            ['未知高僧'] = 0x1FE,
            ['森林雪人术士'] = 0x1F7,
            ['平原雪人幼崽'] = 0x1F8,
            ['平原雪人'] = 0x1FD,
        },
        -- 银杏谷废矿一层
        [241] = {
            --传送门
            ['银杏谷废矿入口'] = 0x2329,
            ['银杏谷野外入口'] = 0x65,
            ['银杏谷废矿2层入口'] = 0x66,
            --NPC
            ['站哨的自警团员'] = 0x2864,
            ['好友的遗体'] = 0x286E,
            --采集
            ['绿岭矿脉'] = 0x193,
            ['绿岭矿脉'] = 0x192,
            ['阴地群集'] = 0x191,
            --怪物
            ['腐败的残暴尸鬼'] = 0x1FB,
            ['蜘蛛幼崽'] = 0x1F4,
            ['大蜘蛛'] = 0x1F5,
            ['腐烂的尸鬼'] = 0x1F6,
            ['尸鬼'] = 0x1F7,
            ['干瘪的尸鬼'] = 0x1F8,
            ['尖硬的尸鬼'] = 0x1F9,
        },
        -- 银杏谷废矿二层
        [242] = {
            --传送门
            ['银杏谷废矿1层入口'] = 0x65,
            --采集
            ['绿岭矿脉'] = 0x193,
            ['绿岭矿脉'] = 0x192,
            ['洞穴群集'] = 0x191,
            --怪物
            ['腐败的饥饿尸鬼'] = 0x1FD,
            ['恶毒的大蜘蛛'] = 0x1F7,
            ['恶毒的蜘蛛幼崽'] = 0x1F6,
            ['腐烂的尸鬼'] = 0x1F5,
            ['灵活的尸鬼'] = 0x1F4,
            ['狂暴的尸鬼'] = 0x1F8,
            ['残暴的尸鬼'] = 0x1F9,
            ['饥饿的尸鬼'] = 0x1FA,
            ['高僧灵翼奴钧'] = 0x1FB,
        },
        -- 比奇
        [103] = {
            --传送门
            ['比奇王宫'] = 0x2329,
            ['银杏谷野外入口'] = 0x65,
            ['比奇野外入口'] = 0x66,
            ['摊位交易区'] = 0x12E,
            --NPC
            ['药水商人余工'] = 0x5276,
            ['武器商人浩天'] = 0x5262,
            ['服装商人越玲'] = 0x526C,
            ['饰品商人张盈'] = 0x52E4,
            ['书店掌柜文道'] = 0x5280,
            ['内功大师何德'] = 0x53A2,
            ['杂货商人周纵夕'] = 0x528A,
            ['门派商人冰揽'] = 0x5244,
            ['仓库管理员完源'] = 0x5294,
            ['比奇黑铁商人安绍'] = 0x53E8,
            ['国王龙知贤'] = 0x5212,
            ['王宫守备队长洪烈'] = 0x521C,
            ['兵部尚书宗泽'] = 0x5226,
            ['祠部尚书青源'] = 0x5230,
            ['大将军麒虎龙'] = 0x523A,
            ['新兵教官德仁'] = 0x5258,
            ['酒馆掌柜礼鸣'] = 0x529E,
            ['混混英摇'] = 0x52A8,
            ['艺妓樱束'] = 0x52B2,
            ['桃园世家华道灵'] = 0x52BC,
            ['乞丐张平'] = 0x52D0,
            ['芙蓉世家芙摄主'] = 0x52DA,
            ['黄奕世家黄宿颖'] = 0x52F8,
            ['铁匠铺掌柜云成'] = 0x530C,
            ['客栈掌柜工熏'] = 0x5316,
            ['炼金场管理员德元'] = 0x5320,
            ['比奇通行官陈到'] = 0x5334,
            ['比奇新兵齐铁'] = 0x533E,
            ['交易所长洪福'] = 0x5398,
            ['桃园世家桃燕熙'] = 0x53D4,
            ['李佑飞'] = 0x53DE,
        },
        -- 比奇野外
        [104] = {
            --传送门
            ['比奇外围村落'] = 0x2329,
            ['半兽人洞穴1层入口'] = 0x67,
            ['比奇入口'] = 0x65,
            ['蛇谷入口'] = 0x66,
            ['沃玛森林入口'] = 0x68,
            ['红名村'] = 0x6A,
            ['比奇秘谷1层入口'] = 0x69,
            --NPC
            ['遗孀秀兰'] = 0x55FA,
            ['小孩灵儿'] = 0x5604,
            ['垂钓者商伊'] = 0x560E,
            ['樵夫阿楠'] = 0x5618,
            ['投降的森林雪人术士'] = 0x5622,
            ['投降的森林雪人'] = 0x562C,
            ['警卫队长洪德'] = 0x5636,
            ['老母亲豫淑'] = 0x564A,
            ['警卫兵云孝'] = 0x5654,
            ['小孩灵儿'] = 0x565E,
            ['半兽人亚克夏'] = 0x5668,
            ['半兽人咔嗬'] = 0x5672,
            --采集
            ['高级鱼塘'] = 0x19B,
            ['高级鱼塘'] = 0x19C,
            ['魔道矿脉'] = 0x191,
            ['草丛群集'] = 0x192,
            ['草丛群集'] = 0x193,
            --怪物
            ['凶残的蛤蟆'] = 0x1F5,
            ['狼'] = 0x1F4,
            ['大地守护者'] = 0x201,
            ['森林雪人'] = 0x200,
            ['森林雪人幼崽'] = 0x1F6,
            ['狂怒的森林雪人'] = 0x1F7,
            ['强盗团头目'] = 0x1FA,
            ['强盗团刀手'] = 0x1F8,
            ['强盗团弓箭手'] = 0x1F9,
            ['半兽人'] = 0x1FB,
            ['勇猛的半兽人'] = 0x1FC,
            ['毒针蜘蛛幼崽'] = 0x1FF,
            ['毒针蜘蛛'] = 0x1FD,
            ['半兽人莫刹'] = 0x1FE,
        },
    },
    ESCAPE_POS = {
        [0xD4] = { x = 13369.99, y = 2745.75, z = 18056.42, },
        [0xD5] = { x = 19397.49, y = 1883.99, z = 17537.06, },
        [936.0] = { x = 15485, y = 16188, z = 5383 },
        [938.0] = { x = 9182, y = 18130, z = 16359 },
        [1211] = { x = 1627, y = 37170, z = 10151 },
        [721.0] = { x = 15308, y = 44445, z = 5605 }, --封印塔 1
        [401.0] = { x = 14628, y = 2325, z = 15433 }, --周  8小时地图
        [312.0] = { x = 2584, y = 2876, z = 11473 }, --组队副本 封闭的金矿
        [150.0] = { x = 3990, y = 37870, z = 9716 }, --810124-----活动本
        [940.0] = { x = 10273, y = 16307, z = 11430 }, --剧情地图
        [110.0] = { x = 15198, y = 7209, z = 11696 },
        [242.0] = { x = 9310, y = 1190, z = 4767 }, --银杏村废弃矿二层
        [104] = { x = 19670, y = 21770, z = 10747 }, --比奇野外
        [946] = { x = 6658, y = 19111, z = 2863 }, --剧情沃玛四层
        [278] = { x = 36898, y = 8890, z = 5122 }, --沃玛二层
        [279] = { x = 34090, y = 2178, z = 5122 }, --沃玛三层
        [280] = { x = 30590, y = 37988, z = 5122 }, --沃玛四层
        [942] = { x = 26818, y = 43489, z = 2913 }, --蛇谷剧情
        [943] = { x = 9182, y = 22037, z = 5652 }, --比奇剧情
        [222] = { x = 2310, y = 9608, z = 7496 }, --山谷废矿2层
        [223] = { x = 1460, y = 19259, z = 5913 }, --山谷废矿3层
    },
}

local this = map_res

-------------------------------------------------------------------------------------
--


-------------------------------------------------------------------------------------
-- 返回对象
return map_res

-------------------------------------------------------------------------------------