local VERSION = "2023-3-28"
local AUTHOR_NOTE = "Administrator"

---@class shop_res
local shop_res = {
    VERSION = VERSION,
    AUTHOR_NOTE = AUTHOR_NOTE,
    MODULE_NAME = "shop_res",

    --商人NPC
    MERCHANT = {
        --银杏谷商人信息
        [101] = {
            ['药水商人'] = {
                --NPC位置{地图id，地图名,x坐标,y坐标,z坐标}
                npc_pos = { map_id = 101, map_name = "银杏谷村庄", x = 15750.0, y = 17570.0, z = 11634.868164062, teleport_id = 0x2738, rand = 500 },
                --NPC出售物品信息 物品名 = {物品购买id,单价}
                sell_item = {
                    ["生命回复药水（小）"] = { id = 0x643, money = 30 },
                    ["生命回复药水（中）"] = { id = 0x642, money = 65 },
                    ["魔力回复药水（小）"] = { id = 0x646, money = 30 },
                    ["魔力回复药水（中）"] = { id = 0x645, money = 65 }
                }
            },
            ['武器商人'] = {
                npc_pos = { map_id = 101, map_name = "银杏谷村庄", x = 22781.115234375, y = 18518.609375, z = 11400.001953125, teleport_id = 0x272E, rand = 600 },
                sell_item = {
                    ["流月刀"] = { id = 0, money = 5000 }, --TODO:添加购买ID
                    ["三叉戟"] = { id = 0, money = 5000 }, --TODO:添加购买ID
                    ["锐刀"] = { id = 0, money = 5000 }, --TODO:添加购买ID
                },
            },
            ['服装商人'] = {
                npc_pos = { map_id = 101, map_name = "银杏谷村庄", x = 17541.126953125, y = 14521.638671875, z = 11635.336914062, teleport_id = 0x276A, rand = 600 },
                sell_item = {
                    ["轻型甲胄"] = { id = 0, money = 5000 }, --TODO:添加购买ID
                    ["轻型头盔"] = { id = 0, money = 5000 }, --TODO:添加购买ID
                    ["木靴"] = { id = 0, money = 5000 }, --TODO:添加购买ID
                    ["墨铁束腰"] = { id = 0, money = 5000 }, --TODO:添加购买ID
                },
            },
            ['饰品商人'] = {
                npc_pos = { map_id = 101, map_name = "银杏谷村庄", x = 18003.50390625, y = 14056.494140625, z = 11637.034179688, teleport_id = 0x2832, rand = 600 },
                sell_item = {
                    ["铁手链"] = { id = 0, money = 4000 }, --TODO:添加购买ID
                    ["铜戒指"] = { id = 0, money = 4000 }, --TODO:添加购买ID
                    ["金吊坠"] = { id = 0, money = 4000 }, --TODO:添加购买ID
                },
            },
            ['杂货商人'] = {
                npc_pos = { map_id = 101, map_name = "银杏谷村庄", x = 19093.326171875, y = 19373.41796875, z = 11635.7734375, teleport_id = 0x2742, rand = 600 },
                sell_item = {
                    ["割草"] = { id = 0x57B, money = 4000 },
                    ["钓鱼"] = { id = 0x57C, money = 4000 },
                    ["挖矿"] = { id = 0x57D, money = 4000 },
                }
            },
            ['仓库管理'] = {
                npc_pos = { map_id = 101, map_name = "银杏谷村庄", x = 18698.763671875, y = 18418.69140625, z = 11635.790039062, teleport_id = 0x2850, rand = 400 },
            },
        },
        --比奇商人信息
        [103] = {
            ['药水商人'] = {
                npc_pos = { map_id = 103, map_name = "比奇", x = 19390.0, y = 19950.0, z = 5651.7006835938, teleport_id = 0x5276, rand = 500 },
                sell_item = {
                    ["生命回复药水（小）"] = { id = 0x643, money = 30 },
                    ["生命回复药水（中）"] = { id = 0x642, money = 65 },
                    ["魔力回复药水（小）"] = { id = 0x646, money = 30 },
                    ["魔力回复药水（中）"] = { id = 0x645, money = 65 }
                },
            },
            ['武器商人'] = {
                npc_pos = { map_id = 103, map_name = "比奇", x = 17147.15234375, y = 18380.40234375, z = 5651.7006835938, teleport_id = 0x5262, rand = 600 },
                sell_item = {
                    ["流月刀"] = { id = 0, money = 5000 }, --TODO:添加购买ID
                    ["三叉戟"] = { id = 0, money = 5000 }, --TODO:添加购买ID
                    ["锐刀"] = { id = 0, money = 5000 }, --TODO:添加购买ID
                },
            },
            ['服装商人'] = {
                npc_pos = { map_id = 103, map_name = "比奇", x = 25140.38671875, y = 20100.3984375, z = 5651.7006835938, teleport_id = 0x526C, rand = 600 },
                sell_item = {
                    ["轻型甲胄"] = { id = 0, money = 5000 }, --TODO:添加购买ID
                    ["轻型头盔"] = { id = 0, money = 5000 }, --TODO:添加购买ID
                    ["木靴"] = { id = 0, money = 5000 }, --TODO:添加购买ID
                    ["墨铁束腰"] = { id = 0, money = 5000 }, --TODO:添加购买ID
                },
            },
            ['饰品商人'] = {
                npc_pos = { map_id = 103, map_name = "比奇", x = 19781.912109375, y = 19530.001953125, z = 5651.7006835938, teleport_id = 0x52E4, rand = 600 },
                sell_item = {
                    ["铁手链"] = { id = 0, money = 4000 }, --TODO:添加购买ID
                    ["铜戒指"] = { id = 0, money = 4000 }, --TODO:添加购买ID
                    ["金吊坠"] = { id = 0, money = 4000 }, --TODO:添加购买ID
                },

            },
            ['杂货商人'] = {
                npc_pos = { map_id = 103, map_name = "比奇", x = 17159.400390625, y = 14774.293945312, z = 5651.5502929688, teleport_id = 0x528A, rand = 600 },
                sell_item = {
                    ["割草"] = { id = 0x963, money = 4000 },
                    ["钓鱼"] = { id = 0x964, money = 4000 },
                    ["挖矿"] = { id = 0x965, money = 4000 },
                },
            },
            ['仓库管理'] = {
                npc_pos = { map_id = 103, map_name = "比奇", x = 17559.947265625, y = 13929.624023438, z = 5651.5502929688, teleport_id = 0x5294, rand = 400 },
            },
        },
    },
    BUY_INFO = {
        -- 不买红      (为true,不买红)
        -- 不买蓝      (为true不买蓝)
        -- 不维修      (为true不买维修)
        -- 不售物品   (为true不出售绑定物品)
        -- 购买工具     (工具res_id,为nil不购买工具)
        -- 买红数      (最大购买红数)
        -- 触发买红    (触发去买红的数量)
        -- 买蓝数      (最大购买蓝数)
        -- 触发买蓝    (触发去买蓝的数量)
        -- 维修装备    (维修装备的耐久,值大于等于1为定值，1到0之间为百分百)
        -- 工具数量     (购买工具数量)
        ['副本前'] = { ['场景'] = '副本前', ['买红数'] = 999, ['触发买红数'] = 700, ['红药名'] = '生命回复药水（中）', ['买蓝数'] = 999, ['触发买蓝数'] = 700, ['蓝药名'] = '魔力回复药水（中）', ['维修装备'] = 0.9 },
        ['副本'] = { ['场景'] = '副本', ['买红数'] = 999, ['触发买红数'] = 0, ['红药名'] = '生命回复药水（中）', ['买蓝数'] = 999, ['触发买蓝数'] = 999, ['维修装备'] = 50, ['不售物品'] = true },
        ['割草'] = { ['场景'] = '割草', ['买红数'] = 51, ['触发买红数'] = 0, ['红药名'] = '生命回复药水（中）', ['不买蓝'] = true, ['维修装备'] = 2, ['购买工具'] = 0x0000736F, ['工具数量'] = 5, ['工具类型'] = '割草' },
        ['挖矿'] = { ['场景'] = '挖矿', ['买红数'] = 51, ['触发买红数'] = 0, ['红药名'] = '生命回复药水（中）', ['不买蓝'] = true, ['维修装备'] = 2, ['购买工具'] = 0x00007351, ['工具数量'] = 5, ['工具类型'] = '挖矿' },
        ['钓鱼'] = { ['场景'] = '钓鱼', ['买红数'] = 51, ['触发买红数'] = 0, ['红药名'] = '生命回复药水（中）', ['不买蓝'] = true, ['维修装备'] = 2, ['购买工具'] = 0x0000738D, ['工具数量'] = 5, ['工具类型'] = '钓鱼' },
        ['挂机'] = {},
        ['主线'] = { ['场景'] = '主线', ['买红数'] = 999, ['触发买红数'] = 50, ['红药名'] = '生命回复药水（中）', ['买蓝数'] = 999, ['触发买蓝数'] = 50,['蓝药名'] = '魔力回复药水（中）',  ['维修装备'] = 0.3},
        ['主线前期'] = { ['场景'] = '主线前期', ['买红数'] = 200, ['触发买红数'] = 20, ['红药名'] = '生命回复药水（小）', ['买蓝数'] = 400, ['触发买蓝数'] = 20,['蓝药名'] = '魔力回复药水（小）'},
        ['刷铜'] = {},
    },
}

local this = shop_res

this.map_list = {
    [101] = { 102, },
    [103] = { 104, 211, 212, 213, 241, 242, 1211, 1212, 1213 },
    [110] = { 277, 278, 279, 280 }
}

this.shop_list = {
    [101] = {
        ['武器'] = { pos = { 22781.1, 18518.6, 11400.0, 101 }, name = '무기'--[['武器商人']] },
        ['药水'] = { pos = { 15750.0, 17570.0, 11634.8, 101 }, name = '물약'--[['药水商人']] },
    },
    [103] = {
        ['武器'] = { pos = { 17430.0, 18410.0, 5648.4, 103 }, name = '무기'--[['武器商人浩天']] },
        ['药水'] = { pos = { 19390.0, 20370.0, 5648.4, 103 }, name = '물약'--[['药水商人余工']] },
    },
}

this.potion_list = {
    [10] = {
        names = { '체력 회복약(소)', '마력 회복약(소)'--[['生命回复药水（小）', '魔力回复药水（小）']] }, max = 200, min = 80,
        ids = { 0x643, 0x646 }
    },
    [20] = {
        names = { '체력 회복약(중)', '마력 회복약(중)'--[['生命回复药水（小）', '魔力回复药水（小）']] }, max = 300, min = 80,
        ids = { 0x643, 0x646 }
    },
    [30] = {
        names = { '체력 회복약(중)', '마력 회복약(중)'--[['生命回复药水（中）', '魔力回复药水（中）']] }, max = 500, min = 80,
        ids = { 0x642, 0x645 }
    },
}

this.sell_item_list = {
    [30] = {
        '체력 회복약(소)', '마력 회복약(소)', --药水
        '목검', '오목검', '청동검', '아리수옥검', --剑
        '청동투구', '사슬투구', '녹슨투구', --头盔
        '모피허리띠', '가죽허리띠', --腰带
        '경갑옷', '철갑옷', --铠甲
        '가죽신발', '모피신발', --鞋
        '팔각반지', '구리반지', --戒指
        '초롱목걸이', '금장팔찌', '금목걸이', -- 链条
        '철광원석', '광석', '녹주석파편', '옥파편', --矿石
        '뿌리', --植物
        --[['绿柱石残片', '古老的银币',
         '木剑', '乌木剑', '青铜剑',
         '青铜头盔', '生锈的头盔', '轻铠甲', '铁铠甲',
         '铁手链', '金装手链', '银装装手链', '因通手链',
         '铜吊坠', '银吊坠', '金吊坠', '浩龙吊坠',
         '铜戒指',
         '毛皮束腰','皮质束腰','钢铁束腰',
         '皮质鞋', '皮革鞋',]]
    }
}
-------------------------------------------------------------------------------------
-- 返回对象
return shop_res